# Reading Data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("weather_data1.csv")

In [3]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

# Missing Values

In [4]:
df.isnull()

    City  Temperature_C  Humidity_%  Condition
0  False          False       False      False
1  False          False       False      False
2  False           True       False      False
3  False          False       False      False
4  False           True       False      False
5  False          False        True      False
6  False          False       False      False
7  False          False       False      False
8  False           True       False      False
9  False          False       False      False

In [5]:
df.isnull().sum()

City             0
Temperature_C    3
Humidity_%       1
Condition        0
dtype: int64

In [6]:
df_clean=df.dropna()

In [7]:
df_clean

         City  Temperature_C  Humidity_% Condition
0    Hyderbad           28.0        60.0     Sunny
1  Vijayawada           29.0        62.0     Sunny
3    Kakinada           31.0        55.0    Cloudy
6     Chennai           34.0        61.0     Sunny
7  Rajamundry           32.0        63.0    Cloudy
9  Anakapalli           29.0        62.0     Sunny

In [8]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

In [9]:
df["Temperature_C"]=df["Temperature_C"].fillna(df.Temperature_C.mean())

In [10]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad      28.000000        60.0     Sunny
1    Vijayawada      29.000000        62.0     Sunny
2  Viskhapatnam      30.857143        58.0    Cloudy
3      Kakinada      31.000000        55.0    Cloudy
4      Banglore      30.857143        57.0     Rainy
5        Mumbai      33.000000         NaN     Rainy
6       Chennai      34.000000        61.0     Sunny
7    Rajamundry      32.000000        63.0    Cloudy
8         Eluru      30.857143        64.0     Rainy
9    Anakapalli      29.000000        62.0     Sunny

In [11]:
df["Humidity_%"]=df["Humidity_%"].fillna(df["Humidity_%"].mean())
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad      28.000000   60.000000     Sunny
1    Vijayawada      29.000000   62.000000     Sunny
2  Viskhapatnam      30.857143   58.000000    Cloudy
3      Kakinada      31.000000   55.000000    Cloudy
4      Banglore      30.857143   57.000000     Rainy
5        Mumbai      33.000000   60.222222     Rainy
6       Chennai      34.000000   61.000000     Sunny
7    Rajamundry      32.000000   63.000000    Cloudy
8         Eluru      30.857143   64.000000     Rainy
9    Anakapalli      29.000000   62.000000     Sunny